{"0":{"Date":"2022-05-12","Title":"Reggie Fils-Aimé talks web3, AR and his gaming SPAC","Body":"In February 2019, Reggie Fils-Aimé announced that he would be leaving Nintendo after 16 years -- 13 of which were spent as the president and COO of the companys North American division. It was a frui… [+9828 chars]","Author":"Brian Heater"},"1":{"Date":"2022-05-12","Title":"Mark Zuckerberg shows off Meta's next headset (kind of)","Body":"Mark Zuckerberg took to his personal Facebook page today to show off a demo of the company's unreleased \"high-end\" VR headset.\r\nThe physical product, which for now is codenamed Project Cambria, was b… [+1240 chars]","Author":"Lucas Matney"},"2":{"Date":"2022-05-12","Title":"Android Auto is getting a major UI update","Body":"After all the big hardware and software announcements during the I\/O 2022 keynote presentation, today Google is sharing some updates for cars with Android Auto and vehicles with infotainment systems … [+2053 chars]","Author":"Sam Rutherford"},"3":{"Date":"2022-05-12","Title":"Rivian founder and CEO RJ Scaringe is coming to TechCrunch Disrupt this October","Body":"In the growing catalog of EV automakers that have launched in recent years, Rivian is perhaps the buzziest.\r\nThe company's two all-electric vehicles, the R1S SUV and R1T pickup, have captured the att… [+3863 chars]","Author":"Kirsten Korosec"},"4":{"Date":"2022-05-12","Title":"Getting high on HRI","Body":"I know I keep teasing how excited I am about Julys big robotics event, but its precisely because of panels like the one we announced earlier this week. Weve got Rodney Brooks and Clara Vu teaming up … [+6292 chars]","Author":"Brian Heater"},"5":{"Date":"2022-05-12","Title":"Scott Galloway’s edtech startup, Section4, lays off a quarter of staff","Body":"Section4, an upskilling startup launched by prominent NYU professor Scott Galloway, has laid off a quarter of staff sources say. The layoffs, which occurred last week, affected employees across all l… [+3152 chars]","Author":"Natasha Mascarenhas"},"6":{"Date":"2022-05-10","Title":"Xos shows off two new EVs as diesel-guzzling fleets inch towards electrification","Body":"Xos, an EV company that specializes in commercial trucks, took the wraps off two new vehicles this evening as it looks to become a leading provider and operating system for battery-powered fleets.\r\nO… [+2779 chars]","Author":"Harri Weber"},"7":{"Date":"2022-05-12","Title":"Eridan reinvents a piece of mobile infrastructure and calls up $46M in funding","Body":"Most of the time no one has to think about how the mobile networks we all rely on work. But it won't surprise many to hear that, as is often the case with infrastructure, some pieces are the latest t… [+8392 chars]","Author":"Devin Coldewey"},"8":{"Date":"2022-05-11","Title":"Here's everything you need to know from the Google I\/O 2022 keynote today","Body":"It's Google I\/O keynote day! Once a year Google kicks off its developer conference with a rapid-fire stream of announcements, finally unveiling so many of the things they've been working on behind-th… [+6546 chars]","Author":"Greg Kumparak"},"9":{"Date":"2022-05-11","Title":"U.K. taps Virgin Orbit to launch first satellites from its own soil this summer","Body":"The United Kingdom has a small but growing space industry, with the number of space-related organizations increasing by an average of 21 percent each year since 2012, but there is one key component i… [+1771 chars]","Author":"Stefanie Waldek"},"10":{"Date":"2022-05-12","Title":"Going, going…grab one of the last 2 demo tables at TC Sessions: Climate before they’re gone","Body":"Climate-change warriors heed this call! If you want to demo your climate tech at TC Sessions: Climate 2022 on June 14 at UC Berkeley, time is running out. We have only two count em two Startup Demo P… [+4798 chars]","Author":"Lauren Simonds"},"11":{"Date":"2022-05-11","Title":"Sunday Security launches a cybersecurity service for senior execs","Body":"Traditionally, cybersecurity has always focused on what can be hacked and not so much on who might be most at risk. Sunday Security, which is launching today and announcing a $4 million seed funding … [+2890 chars]","Author":"Frederic Lardinois"},"12":{"Date":"2022-05-11","Title":"These AI-powered robot overlords are here to keep your warehouse workers safe(r)","Body":"Last year, Voxel raised $3 million to make warehouses safer through AI-powered security cameras. It has been busy in the background, working and raising funds to further develop its tech to make ware… [+2498 chars]","Author":"Haje Jan Kamps"},"13":{"Date":"2022-05-12","Title":"SkySpecs watches wind turbines from above, lands $80M led by Goldman Sachs","Body":"As wind energy gains ground in the U.S., SkySpecs is using drones and AI to detect future equipment failures before they grind those giant turbine blades to a halt.\r\nThe company, which works with win… [+1194 chars]","Author":"Harri Weber"},"14":{"Date":"2022-05-12","Title":"Hear from Aurora, Nvidia and Waymo about the two roads to autonomous driving at TC Sessions: Mobility","Body":"The road to commercializing autonomous vehicle technology for people has split into two paths.\r\nIn one camp, AV developers like Argo AI, Aurora, Cruise, Motional, Waymo and Zoox are aiming straight f… [+5161 chars]","Author":"Kirsten Korosec"},"15":{"Date":"2022-05-12","Title":"Sponsored post: Tech is evolving — why aren't hiring strategies? Here's how SAP is leading the charge to transform the tech workforce. - TechCrunch","Body":"Tech jobs are in higher demand than ever, but the talent pool is growing at a much slower pace. Particularly as remote work becomes more standard, the IT talent shortage is hitting businesses hard as… [+5567 chars]","Author":"laura.safran"},"16":{"Date":"2022-05-12","Title":"Foxconn to build Fisker PEAR EV at former Lordstown Motors plant in Ohio","Body":"Fisker Inc. and Foxconn said Thursday they will partner to build Fiskers second all-electric model, the PEAR Urban Lifestyle EV, in Ohio now that Foxconn has purchased the former Lordstown Motors pla… [+2157 chars]","Author":"Jaclyn Trop"},"17":{"Date":"2022-05-12","Title":"Ex-Meta crypto chief David Marcus launches Bitcoin payments startup backed by a16z and Paradigm","Body":"After his departure from Facebook in November, many crypto industry insiders speculated where long-time executive David Marcus would land. Today, the former Messenger boss and Paypal executive offere… [+1061 chars]","Author":"Lucas Matney"},"18":{"Date":"2022-05-12","Title":"Roku rolls out a premium bundle combining the Roku Ultra and its Voice Remote Pro","Body":"Roku is making its top-of-the-line device a better deal as competition with Fire TV heats up. The company today announced that its high-end Roku Ultra (originally $89) will now include the Roku Voice… [+1958 chars]","Author":"Lauren Forristal"},"19":{"Date":"2022-05-11","Title":"Google's Pixel Watch arrives this fall","Body":"Heres something to wrap your brain around: Google has never made its own smartwatch. The company has played in and around the space at least since 2014, with announcement of Android Wear, but its nev… [+6340 chars]","Author":"Brian Heater"}}